evidence/performance/checkout-order-isolated/checkout-order-isolated-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/checkout-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m30s max duration (incl. graceful stop):
              * isolated_checkout_baseline: 3 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
isolated_checkout_baseline   [   2% ] 3 VUs  0m01.0s/1m0s

running (0m02.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
isolated_checkout_baseline   [   3% ] 3 VUs  0m02.0s/1m0s

running (0m03.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
isolated_checkout_baseline   [   5% ] 3 VUs  0m03.0s/1m0s

running (0m04.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
isolated_checkout_baseline   [   7% ] 3 VUs  0m04.0s/1m0s

running (0m05.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
isolated_checkout_baseline   [   8% ] 3 VUs  0m05.0s/1m0s

running (0m06.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
isolated_checkout_baseline   [  10% ] 3 VUs  0m06.0s/1m0s

running (0m07.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
isolated_checkout_baseline   [  12% ] 3 VUs  0m07.0s/1m0s

running (0m08.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
isolated_checkout_baseline   [  13% ] 3 VUs  0m08.0s/1m0s

running (0m09.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
isolated_checkout_baseline   [  15% ] 3 VUs  0m09.0s/1m0s

running (0m10.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
isolated_checkout_baseline   [  17% ] 3 VUs  0m10.0s/1m0s

running (0m11.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
isolated_checkout_baseline   [  18% ] 3 VUs  0m11.0s/1m0s

running (0m12.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
isolated_checkout_baseline   [  20% ] 3 VUs  0m12.0s/1m0s

running (0m13.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
isolated_checkout_baseline   [  22% ] 3 VUs  0m13.0s/1m0s

running (0m14.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
isolated_checkout_baseline   [  23% ] 3 VUs  0m14.0s/1m0s

running (0m15.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
isolated_checkout_baseline   [  25% ] 3 VUs  0m15.0s/1m0s

running (0m16.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
isolated_checkout_baseline   [  27% ] 3 VUs  0m16.0s/1m0s

running (0m17.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
isolated_checkout_baseline   [  28% ] 3 VUs  0m17.0s/1m0s

running (0m18.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
isolated_checkout_baseline   [  30% ] 3 VUs  0m18.0s/1m0s

running (0m19.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
isolated_checkout_baseline   [  32% ] 3 VUs  0m19.0s/1m0s

running (0m20.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
isolated_checkout_baseline   [  33% ] 3 VUs  0m20.0s/1m0s

running (0m21.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
isolated_checkout_baseline   [  35% ] 3 VUs  0m21.0s/1m0s

running (0m22.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
isolated_checkout_baseline   [  37% ] 3 VUs  0m22.0s/1m0s

running (0m23.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
isolated_checkout_baseline   [  38% ] 3 VUs  0m23.0s/1m0s

running (0m24.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
isolated_checkout_baseline   [  40% ] 3 VUs  0m24.0s/1m0s

running (0m25.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
isolated_checkout_baseline   [  42% ] 3 VUs  0m25.0s/1m0s

running (0m26.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
isolated_checkout_baseline   [  43% ] 3 VUs  0m26.0s/1m0s

running (0m27.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
isolated_checkout_baseline   [  45% ] 3 VUs  0m27.0s/1m0s

running (0m28.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
isolated_checkout_baseline   [  47% ] 3 VUs  0m28.0s/1m0s

running (0m29.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
isolated_checkout_baseline   [  48% ] 3 VUs  0m29.0s/1m0s

running (0m30.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
isolated_checkout_baseline   [  50% ] 3 VUs  0m30.0s/1m0s

running (0m31.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
isolated_checkout_baseline   [  52% ] 3 VUs  0m31.0s/1m0s

running (0m32.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
isolated_checkout_baseline   [  53% ] 3 VUs  0m32.0s/1m0s

running (0m33.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
isolated_checkout_baseline   [  55% ] 3 VUs  0m33.0s/1m0s

running (0m34.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
isolated_checkout_baseline   [  57% ] 3 VUs  0m34.0s/1m0s

running (0m35.0s), 3/3 VUs, 90 complete and 0 interrupted iterations
isolated_checkout_baseline   [  58% ] 3 VUs  0m35.0s/1m0s

running (0m36.0s), 3/3 VUs, 93 complete and 0 interrupted iterations
isolated_checkout_baseline   [  60% ] 3 VUs  0m36.0s/1m0s

running (0m37.0s), 3/3 VUs, 96 complete and 0 interrupted iterations
isolated_checkout_baseline   [  62% ] 3 VUs  0m37.0s/1m0s

running (0m38.0s), 3/3 VUs, 99 complete and 0 interrupted iterations
isolated_checkout_baseline   [  63% ] 3 VUs  0m38.0s/1m0s

running (0m39.0s), 3/3 VUs, 102 complete and 0 interrupted iterations
isolated_checkout_baseline   [  65% ] 3 VUs  0m39.0s/1m0s

running (0m40.0s), 3/3 VUs, 102 complete and 0 interrupted iterations
isolated_checkout_baseline   [  67% ] 3 VUs  0m40.0s/1m0s

running (0m41.0s), 3/3 VUs, 105 complete and 0 interrupted iterations
isolated_checkout_baseline   [  68% ] 3 VUs  0m41.0s/1m0s

running (0m42.0s), 3/3 VUs, 108 complete and 0 interrupted iterations
isolated_checkout_baseline   [  70% ] 3 VUs  0m42.0s/1m0s

running (0m43.0s), 3/3 VUs, 111 complete and 0 interrupted iterations
isolated_checkout_baseline   [  72% ] 3 VUs  0m43.0s/1m0s

running (0m44.0s), 3/3 VUs, 114 complete and 0 interrupted iterations
isolated_checkout_baseline   [  73% ] 3 VUs  0m44.0s/1m0s

running (0m45.0s), 3/3 VUs, 117 complete and 0 interrupted iterations
isolated_checkout_baseline   [  75% ] 3 VUs  0m45.0s/1m0s

running (0m46.0s), 3/3 VUs, 120 complete and 0 interrupted iterations
isolated_checkout_baseline   [  77% ] 3 VUs  0m46.0s/1m0s

running (0m47.0s), 3/3 VUs, 123 complete and 0 interrupted iterations
isolated_checkout_baseline   [  78% ] 3 VUs  0m47.0s/1m0s

running (0m48.0s), 3/3 VUs, 123 complete and 0 interrupted iterations
isolated_checkout_baseline   [  80% ] 3 VUs  0m48.0s/1m0s

running (0m49.0s), 3/3 VUs, 126 complete and 0 interrupted iterations
isolated_checkout_baseline   [  82% ] 3 VUs  0m49.0s/1m0s

running (0m50.0s), 3/3 VUs, 129 complete and 0 interrupted iterations
isolated_checkout_baseline   [  83% ] 3 VUs  0m50.0s/1m0s

running (0m51.0s), 3/3 VUs, 132 complete and 0 interrupted iterations
isolated_checkout_baseline   [  85% ] 3 VUs  0m51.0s/1m0s

running (0m52.0s), 3/3 VUs, 135 complete and 0 interrupted iterations
isolated_checkout_baseline   [  87% ] 3 VUs  0m52.0s/1m0s

running (0m53.0s), 3/3 VUs, 138 complete and 0 interrupted iterations
isolated_checkout_baseline   [  88% ] 3 VUs  0m53.0s/1m0s

running (0m54.0s), 3/3 VUs, 141 complete and 0 interrupted iterations
isolated_checkout_baseline   [  90% ] 3 VUs  0m54.0s/1m0s

running (0m55.0s), 3/3 VUs, 144 complete and 0 interrupted iterations
isolated_checkout_baseline   [  92% ] 3 VUs  0m55.0s/1m0s

running (0m56.0s), 3/3 VUs, 144 complete and 0 interrupted iterations
isolated_checkout_baseline   [  93% ] 3 VUs  0m56.0s/1m0s

running (0m57.0s), 3/3 VUs, 147 complete and 0 interrupted iterations
isolated_checkout_baseline   [  95% ] 3 VUs  0m57.0s/1m0s

running (0m58.0s), 3/3 VUs, 150 complete and 0 interrupted iterations
isolated_checkout_baseline   [  97% ] 3 VUs  0m58.0s/1m0s

running (0m59.0s), 3/3 VUs, 153 complete and 0 interrupted iterations
isolated_checkout_baseline   [  98% ] 3 VUs  0m59.0s/1m0s

running (1m00.0s), 3/3 VUs, 156 complete and 0 interrupted iterations
isolated_checkout_baseline   [ 100% ] 3 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    checkout_order_success
    ✓ 'rate>0.90' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=126.02ms

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1431    23.627375/s
    checks_succeeded...: 100.00% 1431 out of 1431
    checks_failed......: 0.00%   0 out of 1431

    ✓ products request succeeded
    ✓ selected product exists
    ✓ registration status is 201
    ✓ registration response contains token
    ✓ add to cart succeeded
    ✓ order creation succeeded
    ✓ order response contains id
    ✓ order response contains status
    ✓ order response contains total

    CUSTOM
    checkout_order_duration........: avg=5.073717 min=3.162  med=4.725  max=16.86    p(90)=6.5956   p(95)=7.2529  
    checkout_order_success.........: 100.00% 159 out of 159

    HTTP
    http_req_duration..............: avg=35.14ms  min=2.85ms med=5.54ms max=142.46ms p(90)=124.64ms p(95)=126.02ms
      { expected_response:true }...: avg=35.14ms  min=2.85ms med=5.54ms max=142.46ms p(90)=124.64ms p(95)=126.02ms
    http_req_failed................: 0.00%   0 out of 636
    http_reqs......................: 636     10.501056/s

    EXECUTION
    iteration_duration.............: avg=1.14s    min=1.13s  med=1.14s  max=1.2s     p(90)=1.14s    p(95)=1.15s   
    iterations.....................: 159     2.625264/s
    vus............................: 3       min=3          max=3
    vus_max........................: 3       min=3          max=3

    NETWORK
    data_received..................: 1.9 MB  31 kB/s
    data_sent......................: 189 kB  3.1 kB/s



running (1m00.6s), 0/3 VUs, 159 complete and 0 interrupted iterations
isolated_checkout_baseline ✓ [ 100% ] 3 VUs  1m0s